{
  "intents": [

    {
      "tag": "pozdrav",
      "patterns": [
        "Bok",
        "Pozdrav",
        "Hej",
        "Dobar dan",
        "Ima li koga",
        "Halo",
        "poz",
        "Možemo početi",
        "Trebam pomoć"
      ],
      "responses": [
        "Pozdrav! Kako ti mogu pomoći?",
        "Bok! Postavi pitanje vezano uz studij.",
        "Tu sam za akademska pitanja."
      ]
    },

    {
      "tag": "prijava_ispita",
      "patterns": [
        "Kako prijaviti ispit?",
        "Ne mogu prijaviti ispit.",
        "Gdje se prijavljuje ispit?",
        "Rok za prijavu ispita?",
        "Prijava ispita preko Studomata?",
        "Mogu li još prijaviti ispit?",
        "Kako se prijaviti na kolokvij?",
        "Prijava završnog ispita?",
        "Treba li prijaviti ispit?",
        "Kada se otvara prijava?",
        "Kada je ispit",
        "Gdje se piše ispit",
        "Je li rok ispita promijenjen",
        "Jel se ispit prijavljuje preko studomata",
        "Koliko ispita mogu prijaviti",
        "Koliko sati prije ispita mogu se prijaviti?",
        "Kada počinje sljedeći rok za prijavu?",
        "Koliko puta se mogu prijaviti na isti ispit?",
        "Kada je krajnji rok za prijavu na ispit?",
        "Koliko dugo traje rok za prijavu na redovni ispit?",
        "Koliko sati prije ispita mogu se prijaviti?",
        "Koliko dugo traje rok za prijavu na redovni ispit?",
        "Što ako ispit pada na dan roka?",
        "Može li se ući u rok nakon što je počeo?",
        "Koji su uvjeti da se mogu prijaviti na ispit (npr. položeni kolokviji)?",
        "Može li se prijaviti student koji ima nedovršene obveze?",
        "Može li se prijaviti student na izvanrednom studiju?",
        "Je li potrebna potvrda o pohađanju predavanja?",
        "Gdje i kako plaćam ispitnu naknadu?",
        "Može li se plaćanje ispitne naknade odgoditi?",
        "Kako se točno prijavljuje ispit preko studentskog portala?",
        "Što ako sam zaboravio prijaviti se – mogu li se prijaviti na dan ispita",
        "Koliko puta se mogu prijaviti na isti ispit?",
        "Što ako sam na ispitnoj prijavi, a imam prepreku (bolest)?"
      ],
      "responses": [
        "Ispiti se prijavljuju putem Studomata, obično najkasnije 48 sati prije termina.",
        "Za prijavu ispita koristi Studomat i provjeri status prijave.",
        "Ako imaš problem s prijavom, obrati se referadi."

      ]
    },

    {
      "tag": "rokovi_ispita",
      "patterns": [
        "Kada je sljedeći ispitni rok?",
        "Gdje su objavljeni rokovi?",
        "Datumi ispita za ovaj semestar?",
        "Kada su rokovi u zimskom semestru?",
        "Raspored ispitnih rokova?",
        "Termin ispita iz matematike?",
        "Kada se održava ispit?",
        "Postoji li dodatni rok?",
        "Jesu li objavljeni datumi ispita?",
        "Kada pišem ispit?",
        "Koliko rokova ima",
        "Termin ispita",
        "Kada su rokovi u ljetnom semestru",
        "Postoji li izvanredni rok",
        "Koliko rokova godišnje ima za ovaj predmet?",
        "Kada završava cjelokupni ispitni rok?",
        "Koliko termina ima u jednom roku?",
        "Kada je prvi termin unutar roka?",
        "Što ako propustim cijeli rok – kada je sljedeći?",
        "Koliko dana prije roka se objavljuju termini?",
        "Kada su sljedeći rokovi za ispite?",
        "Koliko rokova godišnje ima za ovaj predmet?",
        "Kada završava cjelokupni ispitni rok?",
        "Kada je rok za ispite na daljinu?",
        "Postoje li posebni rokovi za prve godine?",
        "Je li rok za dodatne ispite isti?",
        "Kada su rokovi za master ispite?",
        "Jesu li rokovi isti za sve fakultete?",
        "Može li se ući u rok nakon što je počeo?",
        "Je li rok za diplomski ispit isti kao za ostale?",
        "Što ako propustim cijeli rok – kada je sljedeći?",
        "Je li rok za diplomski ispit isti kao za ostale?",
        "Jesu li rokovi isti za sve fakultete?",
        "Objavljuju li se promjene rokova e-mailom?",
        "Koliko termina ima u jednom roku",
        "Koliko tjedana traje glavni ispitni rok",
        "Je li rok za žurnu prijavu isti kao za redovitu?",
        "Je li rok za žurnu prijavu isti kao za redovitu?",
        "Koliko dana ima zahtjevni rok za prijavu?",
        "Postoje li termini za usmene ispite odvojeno",
        "Što znači izvanredni rok i kada je?",
        "Jesu li rokovi različiti za međunarodne studente?",
        "Objavljuje li se konačni raspored 24h prije roka?",
        "Može li se rok prekinuti zbog štrajka nastavnika?"
      ],
      "responses": [
        "Rokovi ispita objavljeni su u Studomatu i na web stranici fakulteta.",
        "Datume ispita možeš pronaći u rasporedu ispitnih rokova.",
        "Ako je došlo do promjene termina, provjeri obavijesti kolegija."
      ]
    },

    {
      "tag": "raspored",
      "patterns": [
        "Gdje mogu vidjeti raspored predavanja?",
        "Kada imam nastavu?",
        "U kojoj učionici je predavanje?",
        "Raspored za ovaj tjedan?",
        "Ima li promjena u rasporedu?",
        "Gdje je raspored po grupama?",
        "Kada počinju vježbe?",
        "Tko drži predavanje sutra?",
        "Kada je laboratorij?",
        "Raspored za prvu godinu?",
        "U koliko sati počinju predavanja sutra?",
        "Kada su četvrtkovi predavanja u nastavnom tjednu?",
        "Koliko sati tjedno ima predavanja po predmetu?",
        "Kada se objavljuje novi semestralni raspored?",
        "U kojoj prostoriji su predavanja za moj predmet?",
        "Koliko grupa ima raspored za ovaj predmet?",
        "Je li raspored različit za redovite i izvanredne studente?",
        "Kada se raspored predavanja stvarno finalizira?",
        "Koliko sati prije predavanja se ažurira raspored?",
        "Koliko skupina ima za moj predmet i smije li se mijenjati?",
        "Što raditi ako imam sukob rasporeda s izbornim predmetom?",
        "Tko rješava sukobe između dva obvezna predmeta?",
        "Jesu li laboratorijske vježbe obvezne po rasporedu?",
        "Trebam li posebnu opremu za laboratorijske termine?",
        "Trebam li posebnu opremu za laboratorijske termine?",
        "Kada su gostujuća predavanja uključena u raspored?",
        "Pomiču li se redovni termini zbog gostiju?",
        "Je li obvezno dolaziti na izvanredna predavanja?",
        "Je li prisutnost provjeravana na svakom predavanju",
        "Što ako propustim predavanje – piše li se u indeks?",
        "Jesu li seminari uključeni u glavni raspored?",
        "Koliko dana zadržava portal stari raspored?",
        "Je li raspored dostupan kao iCal kalendar?",
        "Radi li mobilna aplikacija za pregled rasporeda?",
        "Gdje su predavanja vanjskih stručnjaka najavljena?",
        "Je li raspored isti za Erasmus studente?",
        "Postoje li predavanja na engleskom u rasporedu?",
        "Gdje je raspored za interdisciplinarne module",
        "Jesu li seminari uključeni u glavni raspored?",
        "Koliko puta tjedno ima praktične vježbe?",
        "Kako se raspoređuju studenti u grupe za predavanja?"
      ],
      "responses": [
        "Raspored predavanja dostupan je na službenoj web stranici fakulteta.",
        "Provjeri raspored za svoj smjer i godinu studija.",
        "Za promjene rasporeda prati obavijesti nastavnika."
      ]
    },

    {
      "tag": "konzultacije",
      "patterns": [
        "Kada su konzultacije?",
        "Kako dogovoriti termin s profesorom?",
        "Može li se doći na konzultacije?",
        "Termin konzultacija ovog tjedna?",
        "Kako kontaktirati nastavnika?",
        "Treba li se najaviti za konzultacije?",
        "Gdje su objavljeni termini?",
        "Mogu li doći bez dogovora?",
        "Kako rezervirati konzultacije?",
        "Konzultacije online ili uživo?",
        "Koliko dugo traju konzultacije po terminu?",
        "Je li potrebna prethodna najava za konzultacije?",
        "Može li se na konzultacijama dobiti dodatna gradiva?",
        "Koliko studenata može doći na jedne konzultacije?",
        "Jesu li konzultacije za pitanja o ispitima ili materijalu?",
        "Koliko minuta maximalno mogu ostati na konzultacijama?",
        "Postoji li pauza između dva termina konzultacija?",
        "Je li konzultacijska soba zaključana prije termina?",
        "Trebam li studentsku karticu za ulaz na konzultacije?",
        "Gdje su konzultacije za više nastavnika odjednom?",
        "Mogu li rezervirati mjesto unaprijed za konzultacije?",
        "Koje gradiva nastavnik priprema za konzultacije",
        "Jesu li dozvoljeni snimci s konzultacija?",
        "Gdje vidim raspored svih nastavnika za konzultacije?",
        "Piše li se prisutnost na konzultacijama u bodove?",
        "Koliko bodova nosi sudjelovanje na konzultacijama?",
        "Utječu li konzultacije na konačnu ocjenu?",
        "Postoje li konzultacije samo za laboratorijske zadatke?",
        "Gdje su konzultacije za pisanje seminara?",
        "Koliko košta privatna konzultacija van rasporeda?",
        "Je li moguća konzultacija preko videopoziva?",
        "Gdje su konzultacije za pisanje seminara?",
        "Kada su konzultacije za statističke analize?",
        "Postoje li konzultacije samo za laboratorijske zadatke",
        "Jesu li zajedničke konzultacije s asistentima?",
        "Što ako dođem prvi – smijem li birati temu?"
      ],
      "responses": [
        "Termini konzultacija objavljeni su na stranici kolegija ili kod nastavnika.",
        "Za dogovor konzultacija pošalji email nastavniku.",
        "Provjeri treba li prethodna najava za dolazak."
      ]
    },

    {
      "tag": "upis_godine",
      "patterns": [
        "Kako upisati novu godinu?",
        "Koji su rokovi za upis?",
        "Gdje predati dokumente za upis?",
        "Mogu li upisati godinu online?",
        "Upis u višu godinu postupak?",
        "Što ako kasnim s upisom?",
        "Kako upisati predmete?",
        "Treba li platiti školarinu za upis?",
        "Dokumenti za upis godine?",
        "Upis diplomskog studija?",
        "Može li se upis godine napraviti nakon isteka roka i kolika je naknada?",
        "Kada počinje upis za ljetni semestar?",
        "Trebam li položiti sve kolokvije prije upisa godine?",
        "Trebam li osobno doći u referadu za upis?",
        "Dobivam li potvrdu o upisu i kako je dobiti?",
        "Koliko ECTS bodova minimalno treba za upis više godine?",
        "Računaju li se bodovi iz prethodne godine za upis?",
        "Što ako imam samo prosječne ocjene – smijem li se upisati?",
        "Uračunavaju li se bodovi iz izbornih predmeta u upis?",
        "Koliko predmeta obvezno treba upisati u novu godinu?",
        "Je li potrebno odabrati modul pri upisu godine?",
        "Što ako želim promijeniti smjer tijekom upisa?",
        "Može li se upis godine napraviti bez plaćene školarine?",
        "Kolika je kazna ako ne upišem godinu na vrijeme?",
        "Dobivam li povrat školarine ako raskinem upis?",
        "Radi li upis godine preko mobilne aplikacije?",
        "Koliko dugo čekam odobrenje upisa nakon podnošenja?",
        "Mogu li se upisati na pola godine (npr. samo semestar)?",
        "Što ako sam upisao, ali želim otkazati odmah?",
        "Dobivam li bonus bodove za pravovremeni upis?",
        "Koliko godina maximalno mogu biti redovni student?",
        "Je li upis moguć ako sam već završio studij?",
        "Što piše u pravilniku o upisu više godine?",
        "Dobivam li tiskanu potvrdu odmah nakon online upisa?",
        "Postoje li olakšice za upis za studente iz socijalno ugroženih obitelji?",
        "Je li rok za upis produžen za studente na praksi?",
        "Koliko dana nakon semestra traje upisni rok?",
        "Koliko ECTS bodova iz izbornih računa se za upis sljedeće godine?",
        "Što znači upis s uvjetom i kada se koristi?",
        "Postoje li kvote za upis određenih godina studija?",
        "Je li upis moguć za studente koji su završili drugi fakultet?"
      ],
      "responses": [
        "Upis godine vrši se prema uputama objavljenima na web stranici fakulteta.",
        "Provjeri rokove i potrebnu dokumentaciju za upis.",
        "Ako kasniš s upisom, obrati se referadi."
      ]
    },

    {
      "tag": "dokumentacija",
      "patterns": [
        "Trebam potvrdu o studiranju.",
        "Kako dobiti prijepis ocjena?",
        "Gdje podići potvrdu?",
        "Potvrda za stipendiju?",
        "Koliko se čeka potvrda?",
        "Mogu li dobiti dokument online?",
        "Izdavanje potvrde za dom?",
        "Kako zatražiti uvjerenje?",
        "Dokumenti za posao?",
        "Treba mi službeni dokument s fakulteta.",
        "Koji dokumenti su potrebni za upis prve godine?",
        "Trebam li predati rodni list za bilo koju proceduru",
        "Kako dobiti potvrdu o prosjeku ocjena?",
        "Trebam li PIN za preuzimanje prepisa ocjena?",
        "Koliko košta hitno izdavanje potvrde?",
        "Može li se dokumentacija poslati e-mailom?",
        "Kako dobiti potvrdu o aktivnom statusu studenta za posao?",
        "Koliko košta prepis ocjena za inozemne fakultete?",
        "Trebam li posebnu potvrdu za studentski smještaj?",
        "Gdje naručim diplomatsku listu nakon obrane završnog rada?",
        "Je li moguće dobiti potvrdu o upisu isti dan?",
        "Kolika je naknada za ekspresno izdavanje indeksa?",
        "Dobivam li dokumentaciju za vikend ili samo radnim danima?",
        "Što ako trebam potvrdu hitno za stipendiju – koliko čekam?",
        "Je li izdavanje indeksa moguće u isti dan?",
        "Kada su najduže čekanja na dokumentaciju (npr. ljeti)?",
        "Jesu li sve potvrde dostupne kao e-dokumenti s pečatom?",
        "Može li se potvrda poslati direktno na e-mail fakulteta?",
        "Kako ispraviti grešku u prepisu ocjena?",
        "Je li dokumentacija prevedena na engleski besplatno?",
        "Mogu li dobiti arhivu svih svojih ispita iz prve godine?",
        "Je li moguće dobiti skeniranu kopiju starog indeksa?",
        "Koliko godina čuva fakultet studentsku dokumentaciju?",
        "ože li se potvrda poslati direktno na e-mail fakulteta?",
        "Je li izdavanje indeksa moguće u isti dan?"
      ],
      "responses": [
        "Potvrdu o studiranju ili prijepis ocjena možeš zatražiti u referadi.",
        "Provjeri može li se dokument preuzeti putem online sustava.",
        "Za detalje o rokovima izrade obrati se referadi."
      ]
    },

    {
      "tag": "zavrsni_rad",
      "patterns": [
        "Kako prijaviti završni rad?",
        "Postupak diplomskog rada?",
        "Kako odabrati mentora?",
        "Rok za prijavu teme?",
        "Kada je obrana rada?",
        "Što treba predati uz rad?",
        "Koliko primjeraka rada se predaje?",
        "Gdje prijaviti temu rada?",
        "Mogu li promijeniti mentora?",
        "Pravilnik o završnom radu?",
        "Koliko dugo traje rok za predaju završnog rada?",
        "Kada su obrane završnih radova u sljedećem roku?",
        "Koji su uvjeti za prijavu završnog rada (npr. položeni ispiti)?",
        "Trebam li sve ispite položene prije prijave završnog rada?",
        "Koliko ECTS bodova treba za prijavu završnog rada?",
        "Može li se prijaviti završni rad iz više predmeta odjednom?",
        "Je li potrebna preporuka mentora za prijav",
        "Gdje vidim popis dostupnih tema za završni rad?",
        "Mogu li sam odabrati temu bez mentora?",
        "Je li tema završnog rada fiksna ili se može mijenjati?",
        "Koliko dugo imam za odabir teme nakon prijave?",
        "Kolika je naknada za obranu završnog rada?",
        "Je li cijena različita za preddiplomski i diplomski rad?",
        "Dobivam li povrat naknade ako ne odbranim rad?",
        "Koliko stranica minimalno mora imati završni rad?",
        "Jesu li obvezne privitci i prilozi uz rad?",
        "Koji format koristiti za predaju (Word ili PDF)?",
        "Koliko studenata može imati jedan mentor?",
        "Koliko članova ima povjerenstvo za obranu?",
        "Koliko kopija rada treba predati za obranu?",
        "Dobivam li povratnu kopiju nakon obrane?",
        "Trebam li štampanu verziju uz digitalnu predaju?"
      ],
      "responses": [
        "Postupak završnog rada uključuje odabir mentora, prijavu teme i obranu rada.",
        "Detaljne upute i rokovi objavljeni su na web stranici fakulteta.",
        "Za specifična pitanja obrati se mentoru ili referadi."
      ]
    }

  ]
}
